NevynUK/ESP32-P4-Protected-Mode-Sample/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# The M5Stack Tab5's part reports revision v1.0.  IDF defaults to a minimum of
# v3.1 and the bootloader refuses to flash otherwise ("requires chip revision in
# range [v3.1 - v3.99]").  The <3.0 revisions are gated behind an explicit
# opt-in because IDF cannot support both families in one binary.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# Console on UART0 (GPIO37/38 on the P4), which on this board reaches the
# external USB bridge -- /dev/cu.usbserial-*.  That leaves the USB-Serial/JTAG
# port free for esptool and OpenOCD, so a run can be captured while the board
# is reset through the other port.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# The failure under test is a HANG.  Let it hang: a watchdog reset would hide
# the state we want to halt and inspect over JTAG.
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_INIT=n
CONFIG_BOOTLOADER_WDT_ENABLE=n

# Flash is 16 MB on the Tab5.  This was set to 2 MB, which the ROM noticed on
# every boot ("Detected size(16384k) larger than the size in the binary image
# header(2048k)") and which this project ignored for a long time.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# External PSRAM: 32 MB, HEX (16-line) at 200 MHz.
#
# SPIRAM_SPEED_200M is gated behind IDF_EXPERIMENTAL_FEATURES and the two have
# to be set together -- enabling CONFIG_SPIRAM on its own does not boot.
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# This project programs the PMP itself -- see pmp_apply() in kernel_main.c.
#
# With region protection on, esp_cpu_configure_region_protection() runs first
# and LOCKS every entry it sets, one of which grants U-mode read+write over all
# of internal DRAM.  Locked entries cannot be changed, so there is no way to
# build a kernel/user split on top of it.  Off, the PMP is left in its reset
# state -- every entry OFF, which denies U-mode everything and grants M-mode
# everything -- and the kernel hands back only what the user needs.
#
# The cost is that IDF's PMA entries are not programmed either.  Those cover
# the UNMAPPED gaps in the address space and exist to fault on accesses to
# nothing, so what is lost is a debugging aid rather than any cacheability or
# correctness property of real memory.
CONFIG_BOOTLOADER_REGION_PROTECTION_ENABLE=n
